/* automatically generated by rust-bindgen 0.71.1 */

pub type rosidl_message_typesupport_handle_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const rosidl_message_type_support_t,
        arg2: *const ::std::os::raw::c_char,
    ) -> *const rosidl_message_type_support_t,
>;
#[doc = " Contains rosidl message type support data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_message_type_support_t {
    #[doc = " String identifier for the type_support."]
    pub typesupport_identifier: *const ::std::os::raw::c_char,
    #[doc = " Pointer to the message type support library"]
    pub data: *const ::std::os::raw::c_void,
    #[doc = " Pointer to the message type support handler function"]
    pub func: rosidl_message_typesupport_handle_function,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_message_type_support_t"]
        [::std::mem::size_of::<rosidl_message_type_support_t>() - 24usize];
    ["Alignment of rosidl_message_type_support_t"]
        [::std::mem::align_of::<rosidl_message_type_support_t>() - 8usize];
    ["Offset of field: rosidl_message_type_support_t::typesupport_identifier"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, typesupport_identifier) - 0usize];
    ["Offset of field: rosidl_message_type_support_t::data"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, data) - 8usize];
    ["Offset of field: rosidl_message_type_support_t::func"]
        [::std::mem::offset_of!(rosidl_message_type_support_t, func) - 16usize];
};
pub const rosidl_runtime_c__message_initialization_ROSIDL_RUNTIME_C_MSG_INIT_ALL:
    rosidl_runtime_c__message_initialization = 0;
pub const rosidl_runtime_c__message_initialization_ROSIDL_RUNTIME_C_MSG_INIT_SKIP:
    rosidl_runtime_c__message_initialization = 1;
pub const rosidl_runtime_c__message_initialization_ROSIDL_RUNTIME_C_MSG_INIT_ZERO:
    rosidl_runtime_c__message_initialization = 2;
pub const rosidl_runtime_c__message_initialization_ROSIDL_RUNTIME_C_MSG_INIT_DEFAULTS_ONLY:
    rosidl_runtime_c__message_initialization = 3;
pub type rosidl_runtime_c__message_initialization = ::std::os::raw::c_uint;
#[doc = " Structure used to describe a single field of an interface type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_typesupport_introspection_c__MessageMember_s {
    #[doc = " The name of the field."]
    pub name_: *const ::std::os::raw::c_char,
    #[doc = " The type of the field as a value of the field types enum\n rosidl_typesupport_introspection_c_field_types.\n e.g. rosidl_typesupport_introspection_c__ROS_TYPE_FLOAT"]
    pub type_id_: u8,
    #[doc = " If the field is a string, the upper bound on the length of the string."]
    pub string_upper_bound_: usize,
    #[doc = " If the type_id_ value is rosidl_typesupport_introspection_c__ROS_TYPE_MESSAGE,\n this points to an array describing the fields of the sub-interface."]
    pub members_: *const rosidl_message_type_support_t,
    #[doc = " True if this field is an array type, false if it is any other type. An\n array has the same value for / type_id_."]
    pub is_array_: bool,
    #[doc = " If is_array_ is true, this contains the number of members in the array."]
    pub array_size_: usize,
    #[doc = " If is_array_ is true, this specifies if the array has a maximum size. If it is true, the\n value in array_size_ is the maximum size."]
    pub is_upper_bound_: bool,
    #[doc = " The bytes into the interface's in-memory representation that this field can be found at."]
    pub offset_: u32,
    #[doc = " If the interface has a default value, this points to it."]
    pub default_value_: *const ::std::os::raw::c_void,
    #[doc = " If is_array_ is true, a pointer to a function that gives the size of one member of the array."]
    pub size_function:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void) -> usize>,
    #[doc = " If is_array_ is true, a pointer to a function that gives a const pointer to the member of the\n array indicated by index."]
    pub get_const_function: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            index: usize,
        ) -> *const ::std::os::raw::c_void,
    >,
    #[doc = " If is_array_ is true, a pointer to a function that gives a pointer to the member of the\n array indicated by index."]
    pub get_function: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            index: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Pointer to a function that fetches (i.e. copies) an item from\n an array or sequence member. It takes a pointer to the member,\n an index (which is assumed to be valid), and a pointer to a\n pre-allocated value (which is assumed to be of the correct type).\n\n Available for array and sequence members."]
    pub fetch_function: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            index: usize,
            arg2: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Pointer to a function that assigns (i.e. copies) a value to an\n item in an array or sequence member. It takes a pointer to the\n member, an index (which is assumed to be valid), and a pointer\n to an initialized value (which is assumed to be of the correct\n type).\n\n Available for array and sequence members."]
    pub assign_function: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            index: usize,
            arg2: *const ::std::os::raw::c_void,
        ),
    >,
    #[doc = " If is_array_ is true, a pointer to a function that resizes the array."]
    pub resize_function: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, size: usize) -> bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_typesupport_introspection_c__MessageMember_s"]
        [::std::mem::size_of::<rosidl_typesupport_introspection_c__MessageMember_s>() - 112usize];
    ["Alignment of rosidl_typesupport_introspection_c__MessageMember_s"]
        [::std::mem::align_of::<rosidl_typesupport_introspection_c__MessageMember_s>() - 8usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::name_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        name_
    ) - 0usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::type_id_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        type_id_
    ) - 8usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::string_upper_bound_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        string_upper_bound_
    )
        - 16usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::members_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        members_
    ) - 24usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::is_array_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        is_array_
    )
        - 32usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::array_size_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        array_size_
    )
        - 40usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::is_upper_bound_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        is_upper_bound_
    )
        - 48usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::offset_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        offset_
    ) - 52usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::default_value_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        default_value_
    )
        - 56usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::size_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        size_function
    )
        - 64usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::get_const_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        get_const_function
    )
        - 72usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::get_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        get_function
    )
        - 80usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::fetch_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        fetch_function
    )
        - 88usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::assign_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        assign_function
    )
        - 96usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMember_s::resize_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMember_s,
        resize_function
    )
        - 104usize];
};
#[doc = " Structure used to describe a single field of an interface type."]
pub type rosidl_typesupport_introspection_c__MessageMember =
    rosidl_typesupport_introspection_c__MessageMember_s;
#[doc = " Structure used to describe all fields of a single interface type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rosidl_typesupport_introspection_c__MessageMembers_s {
    #[doc = " The namespace in which the interface resides, e.g. \"example_messages__msg\" for\n example_messages/msg"]
    pub message_namespace_: *const ::std::os::raw::c_char,
    #[doc = " The name of the interface, e.g. \"Int16\""]
    pub message_name_: *const ::std::os::raw::c_char,
    #[doc = " The number of fields in the interface"]
    pub member_count_: u32,
    #[doc = " The size of the interface structure in memory"]
    pub size_of_: usize,
    #[doc = " A pointer to the array that describes each field of the interface"]
    pub members_: *const rosidl_typesupport_introspection_c__MessageMember,
    #[doc = " The function used to initialise the interface's in-memory representation"]
    pub init_function: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: rosidl_runtime_c__message_initialization,
        ),
    >,
    #[doc = " The function used to clean up the interface's in-memory representation"]
    pub fini_function:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of rosidl_typesupport_introspection_c__MessageMembers_s"]
        [::std::mem::size_of::<rosidl_typesupport_introspection_c__MessageMembers_s>() - 56usize];
    ["Alignment of rosidl_typesupport_introspection_c__MessageMembers_s"]
        [::std::mem::align_of::<rosidl_typesupport_introspection_c__MessageMembers_s>() - 8usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::message_namespace_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        message_namespace_
    )
        - 0usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::message_name_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        message_name_
    )
        - 8usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::member_count_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        member_count_
    )
        - 16usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::size_of_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        size_of_
    )
        - 24usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::members_"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        members_
    )
        - 32usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::init_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        init_function
    )
        - 40usize];
    ["Offset of field: rosidl_typesupport_introspection_c__MessageMembers_s::fini_function"][::std::mem::offset_of!(
        rosidl_typesupport_introspection_c__MessageMembers_s,
        fini_function
    )
        - 48usize];
};
#[doc = " Structure used to describe all fields of a single interface type."]
pub type rosidl_typesupport_introspection_c__MessageMembers =
    rosidl_typesupport_introspection_c__MessageMembers_s;
#[doc = " Equivalent to float in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_FLOAT : rosidl_typesupport_introspection_c_field_types = 1 ;
#[doc = " Equivalent to double in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_DOUBLE : rosidl_typesupport_introspection_c_field_types = 2 ;
#[doc = " Equivalent to long double in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_LONG_DOUBLE : rosidl_typesupport_introspection_c_field_types = 3 ;
#[doc = " Equivalent to unsigned char in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_CHAR : rosidl_typesupport_introspection_c_field_types = 4 ;
#[doc = " Equivalent to char16_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_WCHAR : rosidl_typesupport_introspection_c_field_types = 5 ;
#[doc = " Equivalent to _Bool in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_BOOLEAN : rosidl_typesupport_introspection_c_field_types = 6 ;
#[doc = " Equivalent to unsigned char in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_OCTET : rosidl_typesupport_introspection_c_field_types = 7 ;
#[doc = " Equivalent to uint8_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_UINT8 : rosidl_typesupport_introspection_c_field_types = 8 ;
#[doc = " Equivalent to int8_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_INT8 : rosidl_typesupport_introspection_c_field_types = 9 ;
#[doc = " Equivalent to uint16_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_UINT16 : rosidl_typesupport_introspection_c_field_types = 10 ;
#[doc = " Equivalent to int16_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_INT16 : rosidl_typesupport_introspection_c_field_types = 11 ;
#[doc = " Equivalent to uint32_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_UINT32 : rosidl_typesupport_introspection_c_field_types = 12 ;
#[doc = " Equivalent to int32_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_INT32 : rosidl_typesupport_introspection_c_field_types = 13 ;
#[doc = " Equivalent to uint64_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_UINT64 : rosidl_typesupport_introspection_c_field_types = 14 ;
#[doc = " Equivalent to int64_t in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_INT64 : rosidl_typesupport_introspection_c_field_types = 15 ;
#[doc = " Equivalent to char * in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_STRING : rosidl_typesupport_introspection_c_field_types = 16 ;
#[doc = " Equivalent to char16_t * in C types."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_WSTRING : rosidl_typesupport_introspection_c_field_types = 17 ;
#[doc = " An embedded message type."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_MESSAGE : rosidl_typesupport_introspection_c_field_types = 18 ;
#[doc = " For backward compatibility only."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_FLOAT32 : rosidl_typesupport_introspection_c_field_types = 1 ;
#[doc = " For backward compatibility only."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_FLOAT64 : rosidl_typesupport_introspection_c_field_types = 2 ;
#[doc = " For backward compatibility only."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_BOOL : rosidl_typesupport_introspection_c_field_types = 6 ;
#[doc = " For backward compatibility only."]
pub const rosidl_typesupport_introspection_c_field_types_rosidl_typesupport_introspection_c__ROS_TYPE_BYTE : rosidl_typesupport_introspection_c_field_types = 7 ;
#[doc = " Possible types for message fields on a ROS message\n The equivalent OMG IDL and C types of the different fields can be found\n at http://design.ros2.org/articles/idl_interface_definition.html#type-mapping"]
pub type rosidl_typesupport_introspection_c_field_types = ::std::os::raw::c_uint;
#[doc = " Struct defined in msg/Time in the package builtin_interfaces.\n**\n* This message communicates ROS Time defined here:\n* https://design.ros2.org/articles/clock_and_time.html\n*/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct builtin_interfaces__msg__Time {
    #[doc = " The seconds component, valid over all int32 values."]
    pub sec: i32,
    #[doc = " The nanoseconds component, valid in the range [0, 1e9), to be added to the seconds component.\n e.g.\n The time -1.7 seconds is represented as {sec: -2, nanosec: 3e8}\n The time 1.7 seconds is represented as {sec: 1, nanosec: 7e8}"]
    pub nanosec: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of builtin_interfaces__msg__Time"]
        [::std::mem::size_of::<builtin_interfaces__msg__Time>() - 8usize];
    ["Alignment of builtin_interfaces__msg__Time"]
        [::std::mem::align_of::<builtin_interfaces__msg__Time>() - 4usize];
    ["Offset of field: builtin_interfaces__msg__Time::sec"]
        [::std::mem::offset_of!(builtin_interfaces__msg__Time, sec) - 0usize];
    ["Offset of field: builtin_interfaces__msg__Time::nanosec"]
        [::std::mem::offset_of!(builtin_interfaces__msg__Time, nanosec) - 4usize];
};
